performance-testing/results/summary-miranda.txt
PERFORMING read TESTS
----------------------
running performance test for the benchmark server

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/benchmark-read.json
     script: performance-testing/scripts/benchmark-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.8 MB  18 kB/s
    data_sent..................: 193 kB  1.9 kB/s
    http_req_blocked...........: avg=21.05µs min=3µs    med=7µs    max=1.88ms  p(90)=11µs    p(95)=16µs   
    http_req_connecting........: avg=6.49µs  min=0s     med=0s     max=703µs   p(90)=0s      p(95)=0s     
    http_req_duration..........: avg=23.07ms min=9.64ms med=22.6ms max=47.9ms  p(90)=30.99ms p(95)=33.77ms
    http_req_receiving.........: avg=78.74µs min=30µs   med=75µs   max=940µs   p(90)=102µs   p(95)=114µs  
    http_req_sending...........: avg=36.06µs min=11µs   med=31µs   max=824µs   p(90)=49µs    p(95)=61µs   
    http_req_tls_handshaking...: avg=0s      min=0s     med=0s     max=0s      p(90)=0s      p(95)=0s     
    http_req_waiting...........: avg=22.95ms min=9.55ms med=22.5ms max=47.62ms p(90)=30.9ms  p(95)=33.68ms
    http_reqs..................: 1000    9.745056/s
    iteration_duration.........: avg=1.02s   min=1s     med=1.02s  max=1.05s   p(90)=1.03s   p(95)=1.03s  
    iterations.................: 1000    9.745056/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
running performance test for styx server - using 5 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-read-5.json
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.8 MB  17 kB/s
    data_sent..................: 179 kB  1.7 kB/s
    http_req_blocked...........: avg=17.81µs min=2µs     med=6µs     max=1.37ms   p(90)=9.1µs    p(95)=14µs    
    http_req_connecting........: avg=6.88µs  min=0s      med=0s      max=838µs    p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=76.67ms min=43.03ms med=68.57ms max=284.53ms p(90)=100.19ms p(95)=143.93ms
    http_req_receiving.........: avg=68.67µs min=30µs    med=65µs    max=171µs    p(90)=88µs     p(95)=95.04µs 
    http_req_sending...........: avg=30.84µs min=12µs    med=28µs    max=213µs    p(90)=41.1µs   p(95)=52µs    
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=76.57ms min=42.96ms med=68.47ms max=284.32ms p(90)=100.09ms p(95)=143.85ms
    http_reqs..................: 1000    9.224728/s
    iteration_duration.........: avg=1.07s   min=1.04s   med=1.06s   max=1.28s    p(90)=1.1s     p(95)=1.14s   
    iterations.................: 1000    9.224728/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-1
running performance test for styx server - using 4 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-read-4.json
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.8 MB  17 kB/s
    data_sent..................: 179 kB  1.7 kB/s
    http_req_blocked...........: avg=19.52µs min=3µs     med=6µs     max=1.41ms   p(90)=10µs    p(95)=14.04µs 
    http_req_connecting........: avg=4.81µs  min=0s      med=0s      max=597µs    p(90)=0s      p(95)=0s      
    http_req_duration..........: avg=78.68ms min=41.99ms med=71.49ms max=303.9ms  p(90)=98.85ms p(95)=116.45ms
    http_req_receiving.........: avg=70.75µs min=31µs    med=65µs    max=666µs    p(90)=90µs    p(95)=101µs   
    http_req_sending...........: avg=31.13µs min=12µs    med=27µs    max=259µs    p(90)=41µs    p(95)=49µs    
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
    http_req_waiting...........: avg=78.58ms min=41.9ms  med=71.4ms  max=303.58ms p(90)=98.72ms p(95)=116.35ms
    http_reqs..................: 1000    9.231119/s
    iteration_duration.........: avg=1.08s   min=1.04s   med=1.07s   max=1.3s     p(90)=1.09s   p(95)=1.11s   
    iterations.................: 1000    9.231119/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-2
running performance test for styx server - using 3 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-read-3.json
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.8 MB  17 kB/s
    data_sent..................: 179 kB  1.7 kB/s
    http_req_blocked...........: avg=21.57µs min=2µs     med=6µs     max=1.91ms   p(90)=9µs     p(95)=12µs    
    http_req_connecting........: avg=4.98µs  min=0s      med=0s      max=584µs    p(90)=0s      p(95)=0s      
    http_req_duration..........: avg=73.15ms min=40.83ms med=68.74ms max=218.9ms  p(90)=89.53ms p(95)=105ms   
    http_req_receiving.........: avg=68.89µs min=32µs    med=65µs    max=812µs    p(90)=87µs    p(95)=94µs    
    http_req_sending...........: avg=30.5µs  min=11µs    med=26µs    max=848µs    p(90)=41.1µs  p(95)=51µs    
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
    http_req_waiting...........: avg=73.05ms min=40.77ms med=68.63ms max=218.81ms p(90)=89.44ms p(95)=104.92ms
    http_reqs..................: 1000    9.272805/s
    iteration_duration.........: avg=1.07s   min=1.04s   med=1.07s   max=1.21s    p(90)=1.09s   p(95)=1.1s    
    iterations.................: 1000    9.272805/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-3
running performance test for styx server - using 2 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-read-2.json
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.8 MB  17 kB/s
    data_sent..................: 179 kB  1.7 kB/s
    http_req_blocked...........: avg=20.65µs min=2µs     med=6µs     max=1.74ms   p(90)=9µs     p(95)=13µs    
    http_req_connecting........: avg=6.05µs  min=0s      med=0s      max=677µs    p(90)=0s      p(95)=0s      
    http_req_duration..........: avg=72.7ms  min=41.85ms med=68.65ms max=201.1ms  p(90)=90.62ms p(95)=107.69ms
    http_req_receiving.........: avg=67.8µs  min=30µs    med=64µs    max=198µs    p(90)=86µs    p(95)=96µs    
    http_req_sending...........: avg=32.41µs min=9µs     med=27µs    max=394µs    p(90)=43µs    p(95)=52µs    
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
    http_req_waiting...........: avg=72.6ms  min=41.77ms med=68.56ms max=201.01ms p(90)=90.53ms p(95)=107.61ms
    http_reqs..................: 1000    9.280375/s
    iteration_duration.........: avg=1.07s   min=1.04s   med=1.07s   max=1.2s     p(90)=1.09s   p(95)=1.1s    
    iterations.................: 1000    9.280375/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-4
running performance test for styx server - using 1 node

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-read-1.json
     script: performance-testing/scripts/styx-read.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.8 MB  16 kB/s
    data_sent..................: 179 kB  1.6 kB/s
    http_req_blocked...........: avg=16.39µs min=2µs     med=6µs     max=1.29ms   p(90)=9µs      p(95)=12.04µs 
    http_req_connecting........: avg=3.62µs  min=0s      med=0s      max=417µs    p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=88.9ms  min=52.07ms med=82.7ms  max=299.11ms p(90)=114.94ms p(95)=129.73ms
    http_req_receiving.........: avg=70.57µs min=32µs    med=65µs    max=729µs    p(90)=92µs     p(95)=103µs   
    http_req_sending...........: avg=32.63µs min=12µs    med=27µs    max=1.41ms   p(90)=40µs     p(95)=53µs    
    http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=88.8ms  min=51.99ms med=82.61ms max=298.7ms  p(90)=114.84ms p(95)=129.62ms
    http_reqs..................: 1000    9.130981/s
    iteration_duration.........: avg=1.09s   min=1.05s   med=1.08s   max=1.3s     p(90)=1.11s    p(95)=1.13s   
    iterations.................: 1000    9.130981/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10



PERFORMING write TESTS
----------------------
running performance test for the benchmark server

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/benchmark-write.json
     script: performance-testing/scripts/benchmark-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.3 MB  13 kB/s
    data_sent..................: 212 kB  2.1 kB/s
    http_req_blocked...........: avg=21.89µs min=2µs    med=6µs     max=1.66ms   p(90)=10µs    p(95)=15µs   
    http_req_connecting........: avg=5.02µs  min=0s     med=0s      max=829µs    p(90)=0s      p(95)=0s     
    http_req_duration..........: avg=27.49ms min=9.48ms med=23.52ms max=291.19ms p(90)=35.63ms p(95)=41.53ms
    http_req_receiving.........: avg=70.18µs min=31µs   med=67µs    max=476µs    p(90)=92.1µs  p(95)=103µs  
    http_req_sending...........: avg=32.5µs  min=10µs   med=28µs    max=366µs    p(90)=46.1µs  p(95)=58.04µs
    http_req_tls_handshaking...: avg=0s      min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s     
    http_req_waiting...........: avg=27.38ms min=9.4ms  med=23.43ms max=290.82ms p(90)=35.56ms p(95)=41.4ms 
    http_reqs..................: 1000    9.706166/s
    iteration_duration.........: avg=1.02s   min=1.01s  med=1.02s   max=1.29s    p(90)=1.03s   p(95)=1.04s  
    iterations.................: 1000    9.706166/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
running performance test for styx server - using 5 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-write-5.json
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.3 MB  7.5 kB/s
    data_sent..................: 198 kB  1.1 kB/s
    http_req_blocked...........: avg=18.13µs  min=3µs      med=6µs      max=1.37ms p(90)=9µs      p(95)=12µs    
    http_req_connecting........: avg=4.17µs   min=0s       med=0s       max=545µs  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=728.51ms min=311.76ms med=700.88ms max=2.92s  p(90)=820.6ms  p(95)=870.52ms
    http_req_receiving.........: avg=81.6µs   min=49µs     med=79µs     max=192µs  p(90)=106µs    p(95)=115µs   
    http_req_sending...........: avg=30µs     min=16µs     med=26µs     max=263µs  p(90)=40µs     p(95)=44µs    
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=728.4ms  min=311.68ms med=700.75ms max=2.92s  p(90)=820.52ms p(95)=870.42ms
    http_reqs..................: 1000    5.759596/s
    iteration_duration.........: avg=1.72s    min=1.31s    med=1.7s     max=3.92s  p(90)=1.82s    p(95)=1.87s   
    iterations.................: 1000    5.759596/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-1
running performance test for styx server - using 4 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-write-4.json
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.3 MB  8.7 kB/s
    data_sent..................: 198 kB  1.3 kB/s
    http_req_blocked...........: avg=17.62µs  min=3µs      med=6µs      max=1.35ms p(90)=9µs      p(95)=11µs    
    http_req_connecting........: avg=5.14µs   min=0s       med=0s       max=582µs  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=495.58ms min=231.4ms  med=482.81ms max=1.82s  p(90)=566.55ms p(95)=596.97ms
    http_req_receiving.........: avg=78.75µs  min=48µs     med=75µs     max=1.03ms p(90)=100µs    p(95)=109µs   
    http_req_sending...........: avg=28.02µs  min=16µs     med=25µs     max=224µs  p(90)=37µs     p(95)=42µs    
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=495.47ms min=231.29ms med=482.72ms max=1.82s  p(90)=566.45ms p(95)=596.86ms
    http_reqs..................: 1000    6.653613/s
    iteration_duration.........: avg=1.49s    min=1.23s    med=1.48s    max=2.82s  p(90)=1.56s    p(95)=1.59s   
    iterations.................: 1000    6.653613/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-2
running performance test for styx server - using 3 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-write-3.json
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.3 MB  9.8 kB/s
    data_sent..................: 198 kB  1.5 kB/s
    http_req_blocked...........: avg=16.14µs  min=3µs      med=5µs      max=1.24ms p(90)=9µs      p(95)=12µs    
    http_req_connecting........: avg=4.36µs   min=0s       med=0s       max=581µs  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=314.73ms min=174.8ms  med=300.18ms max=1.34s  p(90)=368.09ms p(95)=401.79ms
    http_req_receiving.........: avg=73.93µs  min=46µs     med=70µs     max=528µs  p(90)=97µs     p(95)=103µs   
    http_req_sending...........: avg=27.47µs  min=15µs     med=24µs     max=244µs  p(90)=37µs     p(95)=42µs    
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=314.63ms min=174.72ms med=300.09ms max=1.34s  p(90)=367.98ms p(95)=401.68ms
    http_reqs..................: 1000    7.565145/s
    iteration_duration.........: avg=1.31s    min=1.17s    med=1.3s     max=2.35s  p(90)=1.36s    p(95)=1.4s    
    iterations.................: 1000    7.565145/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-3
running performance test for styx server - using 2 nodes

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-write-2.json
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.3 MB  11 kB/s
    data_sent..................: 198 kB  1.7 kB/s
    http_req_blocked...........: avg=17.16µs  min=3µs      med=5µs      max=1.43ms p(90)=8µs      p(95)=11µs    
    http_req_connecting........: avg=5.07µs   min=0s       med=0s       max=574µs  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=166.51ms min=114.35ms med=157.27ms max=1.05s  p(90)=195.33ms p(95)=212.22ms
    http_req_receiving.........: avg=66.02µs  min=43µs     med=62µs     max=651µs  p(90)=85µs     p(95)=93µs    
    http_req_sending...........: avg=27.84µs  min=14µs     med=22µs     max=1.88ms p(90)=34µs     p(95)=40µs    
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=166.42ms min=114.28ms med=157.19ms max=1.05s  p(90)=195.25ms p(95)=212.1ms 
    http_reqs..................: 1000    8.50909/s
    iteration_duration.........: avg=1.17s    min=1.11s    med=1.16s    max=2.06s  p(90)=1.19s    p(95)=1.21s   
    iterations.................: 1000    8.50909/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/
styx-db-4
running performance test for styx server - using 1 node

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: json=performance-testing/results/styx-write-1.json
     script: performance-testing/scripts/styx-write.js

    duration: -,   iterations: 1000
         vus: 10, max: 10

    done [==========================================================] 1000 / 1000

    ✓ status was 200

    checks.....................: 100.00% ✓ 1000 ✗ 0   
    data_received..............: 1.3 MB  12 kB/s
    data_sent..................: 198 kB  1.8 kB/s
    http_req_blocked...........: avg=17.63µs  min=2µs     med=6µs      max=1.4ms    p(90)=9µs      p(95)=11µs    
    http_req_connecting........: avg=5.79µs   min=0s      med=0s       max=673µs    p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=121.98ms min=69.17ms med=106.23ms max=467.14ms p(90)=156.19ms p(95)=196.5ms 
    http_req_receiving.........: avg=67.49µs  min=42µs    med=63µs     max=191µs    p(90)=88.1µs   p(95)=98.04µs 
    http_req_sending...........: avg=29.05µs  min=12µs    med=26µs     max=171µs    p(90)=40µs     p(95)=49µs    
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=121.88ms min=69.11ms med=106.15ms max=467ms    p(90)=156.07ms p(95)=196.42ms
    http_reqs..................: 1000    8.84264/s
    iteration_duration.........: avg=1.12s    min=1.06s   med=1.11s    max=1.46s    p(90)=1.16s    p(95)=1.2s    
    iterations.................: 1000    8.84264/s
    vus........................: 10      min=10 max=10
    vus_max....................: 10      min=10 max=10

Success! Deleted keys with prefix: req/